ConnectTest/src/DataProcessors/sendPush/sendPush.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
	<name>sendPush</name>
</mdclass:DataProcessor>

ConnectTest/src/InformationRegisters/appCertificates/appCertificates.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>appCertificates</name>
  <resources>
    <name>certificate</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>appType</name>
    <type>
      <types>EnumRef.appTypes</types>
    </type>
  </dimensions>
  <dimensions>
    <name>systemType</name>
    <comment>Операционная система устройства</comment>
    <type>
      <types>EnumRef.systemTypes</types>
    </type>
  </dimensions>
  <dimensions>
    <name>chain</name>
    <type>
      <types>CatalogRef.chains</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ConnectTest/src/Enums/systemTypes/systemTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
	<name>systemTypes</name>
	<enumValues>
		<name>Android</name>
	</enumValues>
	<enumValues>
		<name>iOS</name>
	</enumValues>
	<enumValues>
		<name>Web</name>
	</enumValues>
</mdclass:Enum>

ConnectTest/src/Catalogs/tokens/tokens.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>tokens</name>
  <attributes>
    <name>appType</name>
    <type>
      <types>EnumRef.appTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>lockDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>createDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>FullName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>systemType</name>
    <comment>Операционная система устройства</comment>
    <type>
      <types>EnumRef.systemTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>user</name>
    <type>
      <types>CatalogRef.users</types>
    </type>
  </attributes>
  <attributes>
    <name>chain</name>
    <type>
      <types>CatalogRef.chain</types>
    </type>
  </attributes>
  <attributes>
    <name>holding</name>
    <type>
      <types>CatalogRef.holdings</types>
    </type>
  </attributes>
  <attributes>
    <name>timeZone</name>
    <type>
      <types>CatalogRef.timeZones</types>
    </type>
  </attributes>
</mdclass:Catalog>

ConnectTest/src/DataProcessors/sendPush/Forms/Form/Module.bsl
&AtServer
Procedure SendPushAtServer()
	//--Подготовка заголовка пуш messages
	newWordArray = New Array();
	wordArray = StrSplit(pushTitle, " ");
	For Each word In wordArray Do
		If Найти(word, "#emj") > 0 Then
			word	= DecodeString(StrReplace(word, "#emj", ""), StringEncodingMethod.URLEncoding);
		EndIf;
		newWordArray.add(word);
	EndDo;
	
	titleForPush = StrConcat(newWordArray, " ");	
	//--Подготовка текста пуш messages
	//НЕ ЗАБЫТЬ ЧТО СМАЙЛИК ДОЛЖЕН БЫТЬ В ФОРМАТЕ %F0%9F%8F%8B%20
	newWordArray = New Array();
	wordArray = StrSplit(text, " ");
	For Each word In wordArray Do
		If Найти(word, "#emj") > 0 Then
			word	= DecodeString(StrReplace(word, "#emj", ""), StringEncodingMethod.URLEncoding);
		EndIf;
		newWordArray.add(word);
	EndDo;                       
	pushText = StrConcat(newWordArray, " ");
		
	JSONWriter		= New JSONWriter;
	JSONWriter.SetString();
		
	query	= New Query();
	query.text	= "SELECT
	          	  |	tokens.Ref AS token,
	          	  |	tokens.deviceToken AS deviceToken,
	          	  |	CASE
	          	  |		WHEN tokens.systemType = VALUE(Enum.systemTypes.Android)
	          	  |			THEN ""GCM""
	          	  |		ELSE ""APNS""
	          	  |	END AS SubscriberType,
	          	  |	tokens.chain AS chain,
	          	  |	tokens.appType AS appType,
	          	  |	tokens.systemType AS systemType
	          	  |INTO ВТ
	          	  |FROM
	          	  |	Catalog.tokens AS tokens
	          	  |WHERE
	          	  |	tokens.account IN(&accountArray)
	          	  |	AND tokens.Ref IN(&tokenArray)
	          	  |	AND tokens.lockDate = DATETIME(1, 1, 1)
	          	  |;
	          	  |
	          	  |////////////////////////////////////////////////////////////////////////////////
	          	  |SELECT
	          	  |	ВТ.token AS token,
	          	  |	ВТ.deviceToken AS deviceToken,
	          	  |	ВТ.SubscriberType AS SubscriberType,
	          	  |	ВТ.systemType AS systemType,
	          	  |	ISNULL(appCertificates.certificate, appCertificatesCommon.certificate) AS certificate
	          	  |FROM
	          	  |	ВТ AS ВТ
	          	  |		LEFT JOIN InformationRegister.appCertificates AS appCertificates
	          	  |		ON ВТ.chain = appCertificates.chain
	          	  |			AND ВТ.appType = appCertificates.appType
	          	  |			AND ВТ.systemType = appCertificates.systemType
	          	  |		LEFT JOIN InformationRegister.appCertificates AS appCertificatesCommon
	          	  |		ON (appCertificatesCommon.chain = VALUE(Справочник.chains.ПустаяСсылка))
	          	  |			AND ВТ.appType = appCertificatesCommon.appType
	          	  |			AND ВТ.systemType = appCertificatesCommon.systemType";
	
	query.SetParameter("accountArray", Recipients.Unload().UnloadColumn("account"));
	
	tokenArray	= Recipients.Unload().UnloadColumn("token");
	If tokenArray.Count() = 0 Then
		query.text	= СтрЗаменить(query.text, "AND tokens.ref IN (&tokenArray)", "");	
	Else
		query.SetParameter("tokenArray", tokenArray);
	EndIf;
	
	select = query.Execute().Select();
		
	While select.Next() Do
		If select.deviceToken <> "" Then
			pushStruct = New Structure();
			pushStruct.Insert("title", titleForPush);
			pushStruct.Insert("text", pushText);
			pushStruct.Insert("action", action);
			pushStruct.Insert("objectId", objectId);
			pushStruct.Insert("objectType", objectType);
			pushStruct.Insert("noteId", noteId);
			pushStruct.Insert("deviceToken", select.deviceToken);
			pushStruct.Insert("SubscriberType", select.SubscriberType);
			pushStruct.Insert("title", titleForPush);
			pushStruct.Insert("Badge", 0);
			pushStruct.Insert("systemType", select.systemType);
			pushStruct.Insert("certificate", select.certificate);
			pushStruct.Insert("token", select.token);
			pushStruct.Insert("informationChannel", "");			
			Messages.sendPush(pushStruct);
		EndIf;
	EndDo;

EndProcedure

&AtClient
Procedure SendPush(Command)
	SendPushAtServer();
EndProcedure
